from unittest.mock import Mock, patch

import pytest
from pandas import DataFrame

from src.services import get_transactions_by_keyword


@pytest.fixture
def data() -> list:
    return [
        {
            "Дата операции": "01.01.2018 12:49:53",
            "Дата платежа": "01.01.2018",
            "Номер карты": "",
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Переводы",
            "MCC": "",
            "Описание": "Линзомат ТЦ Юность",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 3000.0,
        },
        {
            "Дата операции": "26.07.2018 09:18:00",
            "Дата платежа": "27.07.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -32.92,
            "Валюта операции": "RUB",
            "Сумма платежа": -32.92,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Транспорт",
            "MCC": 4131.0,
            "Описание": "Московский транспорт",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 32.92,
        },
    ]


@patch("pandas.read_excel")
def test_get_transactions_by_keyword(mock_read: Mock, data: list) -> None:
    mock_read.return_value = DataFrame(data)
    assert get_transactions_by_keyword("Транспорт") == [
        {
            "MCC": 4131.0,
            "Бонусы (включая кэшбэк)": 0,
            "Валюта операции": "RUB",
            "Валюта платежа": "RUB",
            "Дата операции": "26.07.2018 09:18:00",
            "Дата платежа": "27.07.2018",
            "Категория": "Транспорт",
            "Кэшбэк": "",
            "Номер карты": "*7197",
            "Округление на инвесткопилку": 0,
            "Описание": "Московский транспорт",
            "Статус": "OK",
            "Сумма операции": -32.92,
            "Сумма операции с округлением": 32.92,
            "Сумма платежа": -32.92,
        }
    ]
